# Задача 2: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

a = int(input("Введите число: "))

n = a % 10
a = a //10
b = a % 10
c = a //10

print(n+b+c)


